[
  {
    "title": "SPD-Technology: Middle Kotlin Developer (Full-time)",
    "period": {
      "start": "2021-05-01",
      "end": "2025-01-22"
    },
    "project": "Project: floLIVE",
    "description": "Participated in developing a cloud-based platform for managing global IoT networks and mobile telecommunication systems, integrating with worldwide mobile operators. The system is built on a microservices architecture, ensuring high performance, flexibility, scalability, and reliability. Key functionalities include customer management, SIM management, billing operations, traffic routing, data analytics, and automation of IoT-device interactions.",
    "experienceDescription": {
      "experienceDescriptionHeader": "My responsibilities:",
      "listDescription": [
        "Microservices Development: Built scalable, fault-tolerant microservices in Kotlin with Spring Boot and related frameworks (WebFlux, Spring Data, Security), handling billing, invoicing, and reporting. JasperSoft Studio Integration: Implemented dynamic invoice generation and reporting services integrated with JasperSoft Studio",
        "Reactive Programming: Developed asynchronous, non-blocking microservices using Spring WebFlux, significantly enhancing system performance.",
        "REST API Development: Designed and developed REST APIs, closely collaborating with frontend teams for seamless integration.",
        "Messaging with Apache Kafka: Integrated microservices using Kafka, ensuring reliable, scalable communication within an event-driven architecture.",
        "Testing & QA: Created unit and integration tests, ensuring high-quality and reliable code.",
        "CI/CD Automation: Automated build and deployment processes using Docker, Gradle, and Jenkins, optimizing CI/CD pipelines.",
        "Kubernetes & Helm: Gained practical experience deploying microservices on Kubernetes, including creating and managing Helm Charts."
      ],
      "badges": [
        {
          "text": "Kotlin",
          "icon": null
        },
        {
          "text": "Spring Boot",
          "icon": null
        },
        {
          "text": "Spring WebFlux",
          "icon": null
        },
        {
          "text": "Spring Data",
          "icon": null
        },
        {
          "text": "Spring Security",
          "icon": null
        },
        {
          "text": "Postgres",
          "icon": null
        },
        {
          "text": "JPA/Hibernate",
          "icon": null
        },
        {
          "text": "Apache Kafka",
          "icon": null
        },
        {
          "text": "REST API",
          "icon": null
        },
        {
          "text": "Jasper Reports",
          "icon": null
        },
        {
          "text": "Gradle",
          "icon": null
        },
        {
          "text": "Docker",
          "icon": null
        },
        {
          "text": "Jenkins",
          "icon": null
        },
        {
          "text": "Kubernetes",
          "icon": null
        },
        {
          "text": "Helm Charts",
          "icon": null
        },
        {
          "text": "Jira API",
          "icon": null
        },
        {
          "text": "Bitbucket",
          "icon": null
        },
        {
          "text": "JUnit",
          "icon": null
        },
        {
          "text": "Mockito",
          "icon": null
        },
        {
          "text": "Testcontainers",
          "icon": null
        }
      ]
    }
  },
  {
    "title": "Internship SPD-Technology: Junior Java Developer",
    "period": {
      "start": "2021-02-01",
      "end": "2021-04-15"
    },
    "project": "Project: IoT-Security",
    "description": "An internal IoT security platform at SPD Technology, designed to provide real-time insights from IoT devices and enable data visualization for end-users. The solution leveraged modern technologies and followed Agile methodologies, ensuring scalability, reliability, and seamless integration between backend services and the UI.",
    "experienceDescription": {
      "experienceDescriptionHeader": "My responsibilities:",
      "listDescription": [
        "Backend Development:  Contributed to backend architecture and functionality development using Java and Spring Boot, within a 6-member Agile team.",
        "Cross-team Collaboration:  Closely coordinated with QA engineers to ensure software quality through rigorous testing and collaborated with frontend developers to achieve seamless integration between backend services and UI components.",
        "Testing & Quality Assurance:  Developed unit and integration tests to validate functionality, reliability, and overall quality of the solution.",
        "Agile Methodology:  Worked actively using SCRUM methodologies, including sprint planning, daily stand-ups, and iterative improvements."
      ],
      "badges": [
        {
          "text": "Java",
          "icon": null
        },
        {
          "text": "Spring-Boot",
          "icon": null
        },
        {
          "text": "Git-Lab",
          "icon": null
        },
        {
          "text": "REST API",
          "icon": null
        },
        {
          "text": "JUnit",
          "icon": null
        },
        {
          "text": "Agile/SCRUM",
          "icon": null
        },
        {
          "text": "Web Development",
          "icon": null
        }
      ]
    }
  }
]